{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "batch_input_shape": [null, 50, 50, 1], "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "dtype": "float32", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "batch_input_shape": [null, 200, 200, 1], "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "dtype": "float32", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "batch_input_shape": [null, 200, 200, 1], "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "dtype": "float32", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 500, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.004999999888241291}}, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow"}