{"config": [{"config": {"batch_input_shape": [null, 50, 50, 1], "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "use_bias": true, "padding": "valid", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "data_format": "channels_last", "filters": 32, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "use_bias": true, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "use_bias": true, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "filters": 32, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_regularizer": {"config": {"l2": 0.00800000037997961, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 500}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}