{"keras_version": "2.0.6", "config": [{"config": {"activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [6, 6], "batch_input_shape": [null, 50, 50, 1], "trainable": true, "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "strides": [1, 1], "filters": 32, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_regularizer": {"config": {"l2": 0.05000000074505806, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "bias_regularizer": null, "strides": [1, 1], "filters": 32, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_regularizer": {"config": {"l2": 0.05000000074505806, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "bias_regularizer": null, "strides": [1, 1], "filters": 32, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_regularizer": {"config": {"l2": 0.05000000074505806, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "kernel_size": [2, 2], "trainable": true, "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "bias_regularizer": null, "strides": [1, 1], "filters": 32, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "units": 500, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.07999999821186066, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "linear", "units": 2, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}